// DZ1_C++.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <locale>

using namespace std;

int main()
{
    setlocale(LC_ALL, "");

    /*
    ЗАДАНИЕ 1
Вывести на экран один куплет любимого стихотворения
или песни, с указанием автора или исполнителя. Используйте
escape-последовательности для форматирования.
   
    
    cout << " Заметался пожар голубой,\n";
    cout << " Позабылись родимые дали." << endl;
    cout << " В первый раз я запел про любовь," << endl;
    cout << " В первый раз отрекаюсь скандалить." << endl;
    cout << "\t\t\t С. А. Есенин\n";
*/       
        
 /*
 ЗАДАНИЕ 2
Вывести на экран стих «Every hunter wants…» таким образом, чтобы каждый «цвет» начинался с новой строки и
соответствующим количеством табуляций.

   
    cout << "Every\n";

    cout << "\t hunter \n";

    cout << "\t \t wants \n";

    cout << "\t \t \t to\n";

    cout << "\t \t \t \t know \n";

    cout << "\t \t \t \t \t where \n";

    cout << "\t \t \t \t \t \t sits \n";

    cout << "\t \t \t \t \t \t \t the \n";

    cout << "\t \t \t \t \t \t \t \t pheasant. \n";
*/

 /*
 ЗАДАНИЕ 3
Напишите объявление о продаже чего-нибудь и выведите его на экран, в том виде как оно должно было бы быть
напечатано.

    cout << "ОбЪявление!\n"
        << "Продам слона\n"
        << "Слон сувенир..не дорого\n"
        << "Телефон для справок: 44-44-44\n"
        << "|44|44|44|44|\n"
        << "|44|44|44|44|\n"
        << "|44|44|44|44|\n";
*/

}

